&Сервер
Функция ОтправитьСодержимое(отправительИмя, массивАдресаПолучателей, тема, содержимоеТекст, этоАвтоПисьмо = Истина, ФайлВложения = Неопределено, типТекста = Неопределено) Экспорт	
	Если этоАвтоПисьмо Тогда
		Если НЕ Константы.ИспользоватьУведомлениеEmail.Получить() Тогда
			Возврат ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
	Сообщить("ЗАГРЛУШКА ОТМЕНЯЕТ РАССЫЛКУ");
	Возврат ЛОЖЬ;
	
	Если массивАдресаПолучателей.Количество() = 0 Тогда
		Сообщить("Укажите получателя письма!");
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
    Профиль.АдресСервераSMTP = "smtp.spaceweb.ru";
    Профиль.ПортSMTP = 587;
	Профиль.Пользователь = "task@massandra.su";
	Профиль.Пароль = "Task563412";
	Профиль.ПользовательSMTP = "task@massandra.su";
	Профиль.ПарольSMTP = "Task563412";
    // Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;

	Текст = Письмо.Тексты.Добавить(содержимоеТекст, ?(типТекста = Неопределено, ТипТекстаПочтовогоСообщения.ПростойТекст, типТекста) );
	Текст = Письмо.Тексты.Добавить(Символы.ПС);
	Если ФайлВложения <> Неопределено Тогда
		ФайлДляВложения	= ФайлВложения.путь + ФайлВложения.имя;
		Письмо.Вложения.Добавить(ФайлДляВложения, "ЗадачиЗамов");
	КонецЕсли;
	
	Письмо.Тема = тема; 
	Письмо.Отправитель = "task@massandra.su";
    Письмо.ИмяОтправителя = отправительИмя;
	Для Каждого получатель Из массивАдресаПолучателей Цикл
		Письмо.Получатели.Добавить(получатель);
	КонецЦикла;
	
	Почта = Новый ИнтернетПочта;
    Попытка
        Почта.Подключиться(Профиль);
        Почта.Послать(Письмо);
		Сообщить("Почтовое сообщение отправлено успешно! Получатель: " + СтрСоединить(массивАдресаПолучателей, ", "));		
    Исключение
        Сообщить("Не удалось подключиться к почтовому серверу!");
        Сообщить(ОписаниеОшибки());
		Возврат ЛОЖЬ;
    КонецПопытки;
	
	Возврат ИСТИНА;
	Почта.Отключиться();	
	
КонецФункции
