
Процедура ПередВыполнением(Отказ)
	обкБП = БизнесПроцесс.ПолучитьОбъект();
	
	Если БизнесПроцесс.ШагЗадачи = Перечисления.ШагЗадачи.Исполнение Тогда		
		обкБП.ОповеститьСледующегоАдресата("Задача выполнена!");
	КонецЕсли;

	Если (ЗначениеЗаполнено(Делегировать)) Тогда
		обкБП.Исполнитель = Делегировать;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СопоставлениеАдресации.ФункционалВТекущейИБ КАК ФункционалВТекущейИБ
	               |ИЗ
	               |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	               |ГДЕ
	               |	СопоставлениеАдресации.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Делегировать);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Сообщить("Не установлены функции сотрудника!!!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Корректировка Тогда
		обкБП.Исполнитель = Константы.ПолучательПервичногоДокумента.Получить();
		обкБП.ТребуетУточнений = ЛОЖЬ;
		обкБП.ШагЗадачи = Перечисления.ШагЗадачи.ПринятиеВРаботу;
	Иначе
		// Если Выбранно:
		// Вернуть для корректировки - тогда шаг = Корректировка
		// Самостоятельно - тогда шаг = +1
		// Если выбран коллега по отделу - остаться на текущем шаге (просто передать задачу коллеге)
		обкБП.ШагЗадачи = ?(Выборка.ФункционалВТекущейИБ <> Справочники.ФункционалВТекущейИБ.Исполнитель, 
							Перечисления.ШагЗадачи.Корректировка, ?(Делегировать = ПараметрыСеанса.ТекущийПользователь,
							Перечисления.ШагЗадачи.ПолучитьСледующийШагЗадачи( БизнесПроцесс.ШагЗадачи ), обкБП.ШагЗадачи));
							
		Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Корректировка Тогда
			обкБП.Исполнитель = обкБП.ЗаявительФИО;
			обкБП.ТребуетУточнений = ИСТИНА;
		КонецЕсли;		
	КонецЕсли;

	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Завершение Тогда
		обкБП.Завершен = Истина;
		обкБП.ДатаЗавершения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Завершение Тогда		
		подвал = Символы.ПС + Символы.ПС +  " Завершено " + Строка( ТекущаяДатаСеанса() );
	ИначеЕсли обкБП.ШагЗадачи = Перечисления.ШагЗадачи.Отказ Тогда
		подвал = Символы.ПС + Символы.ПС +  " Отказ " + Строка( ТекущаяДатаСеанса() );
	Иначе
		подвал = "";
	КонецЕсли;
	
	обкБП.Комментарий = обкБП.Комментарий + 
	Символы.ПС + 
	Символы.ПС + 
	Символы.ПС +
	ПараметрыСеанса.ТекущийПользователь + 
	"(" + Строка(ТекущаяДатаСеанса()) + ") : " + Символы.ПС + ВВодаКомментария + подвал;	
	
	обкБП.Записать();
КонецПроцедуры
