
&НаСервере
Процедура СформироватьОтчетПоСхемеКомпоновки(СхемаКомпоновкиДанных)
	Отчет = Отчеты.СтатистикаИсполнения.Создать();
   	Отчет.КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
   
	
	датаНач = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
	Если датаНач <> Неопределено Тогда
		датаНач.Значение = Дата( НачалоГода( ТекущаяДата() ) );
		датаНач.Использование = Истина;
	КонецЕсли;
	
	датаКон = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
	Если датаКон <> Неопределено Тогда
		датаКон.Значение = Дата( КонецГода( ТекущаяДата() ) );
		датаКон.Использование = Истина;
	КонецЕсли;
	
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, Новый ДанныеРасшифровкиКомпоновкиДанных);
	
    //Помещаем в переменную данные о расшифровке данных
    ДанныеРасшифровкиОбъект =  Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровкиОбъект,Истина);
	
	//Очищаем поле табличного документа
    МакетСтатистика.Очистить();

	ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(МакетСтатистика);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
    // После окончания процессором вывода отчета, поместим расшифровку во временное хранилище
    ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуИсполнителиНаСервере()
	СхемаКомпоновкиДанных = Отчеты.СтатистикаИсполнителя.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СформироватьОтчетПоСхемеКомпоновки(СхемаКомпоновкиДанных);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуПоДнямНаСервере()
	СхемаКомпоновкиДанных = Отчеты.СтатистикаИсполнения.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	СформироватьОтчетПоСхемеКомпоновки(СхемаКомпоновкиДанных);	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьСтатистику(Команда)
	ОбновитьСтатистикуИсполнителиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатистику1(Команда)
	ОбновитьСтатистикуПоДнямНаСервере();
КонецПроцедуры


