
&НаСервере
Процедура заполнитьУСНаСервере()
	Объект.УчетныеСистемы.Очистить();
	Для каждого э Из Обк.УчетныеСистемы Цикл
		новСтрУС = Объект.УчетныеСистемы.Добавить();
			новСтрУС.Наименование = э.Наименование;
			новСтрУС.ФункцииСотрудника = э.ФункцииСотрудника;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура заполнитьУС(Команда)
	заполнитьУСНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУДНаСервере()
	Объект.УчетныеДанные.Очистить();
	Для каждого э Из Обк.УчетныеДанные Цикл
		новСтрУД = Объект.УчетныеДанные.Добавить();
			новСтрУД.Наименование = э.Наименование;
			новСтрУД.ИмяВхода = э.ИмяВхода;
			новСтрУД.Пароль = э.Пароль;
			новСтрУД.Подключение = э.Подключение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУД(Команда)
	ЗаполнитьУДНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	Если Объект.УчетныеСистемы.Количество() Тогда
		заменяемыйОбк.Файлы.Очистить();
		Для каждого э Из Объект.УчетныеСистемы Цикл
			новСтрУС = заменяемыйОбк.Файлы.Добавить();
				новСтрУС.Наименование = э.Наименование;
				новСтрУС.Файл = э.ФункцииСотрудника;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.УчетныеДанные.Количество() Тогда
		заменяемыйОбк.УчетныеДанные.Очистить();
		Для каждого э Из Объект.УчетныеДанные Цикл
			новСтрУД = заменяемыйОбк.УчетныеДанные.Добавить();
				новСтрУД.Наименование = э.Наименование;
				новСтрУД.ИмяВхода = э.ИмяВхода;
				новСтрУД.Пароль = э.Пароль;
				новСтрУД.Подключение = э.Подключение;
		КонецЦикла;
	КонецЕсли;
	заменяемыйОбк.Записать();
	
	Сообщить("Новые данные записаны!");
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	ЗаменитьНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	заменяемыйОбк.Завершен = ИСТИНА;
	заменяемыйОбк.РуководительИТ = ЛОЖЬ;
	заменяемыйОбк.ОтказКуратором = ЛОЖЬ;
	заменяемыйОбк.РуководительИТКомментарий = РуководительИТКомментарий;
	заменяемыйОбк.Записать();
	
	Сообщить("Обращение завершено!");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();
	СообщитьОКэшировании();
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОКэшировании()
	Сообщить("Для получения внесенных изменений необходимо перезайти в программу так как старые данные кэшированы!");
КонецПроцедуры

&НаСервере
Процедура ЗаменитьРеквизитыНаСервере()
	
	Если Объект.РеквизитыОбращения.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Обк) Тогда
		Сообщить("Нет данных для изменения");
		Возврат;
	КонецЕсли;
	
	текОбк = Обк.ПолучитьОбъект();
	Для Каждого э Из Объект.РеквизитыОбращения Цикл		
		Попытка
			текОбк[э.имя] = э.Значение;
		Исключение
			Сообщить("Ошибка получения реквизита объекта " + э.имя);
		КонецПопытки;
	КонецЦикла;
	текОбк.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьРеквизиты(Команда)
	ЗаменитьРеквизитыНаСервере();
	Сообщить("Объект изменен успешно!");
КонецПроцедуры

&НаСервере
Процедура НаполнитьТЧСтруктура(свойство)
	Для Каждого э Из Обк.Метаданные()[свойство] Цикл
		новаяСтрока = Объект.Структура.Добавить();
		новаяСтрока.Наименование = э.Имя;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуру(Команда)
	Если НЕ ЗначениеЗаполнено(Обк) Тогда
		Сообщить("Укажите изменяемый объект!");
		Возврат;
	КонецЕсли;
	
	Объект.Структура.Очистить();
	НаполнитьТЧСтруктура("Реквизиты");
	НаполнитьТЧСтруктура("СтандартныеРеквизиты");
КонецПроцедуры

&НаСервере
Процедура ОчиститьУДНаСервере()
	заменяемыйОбк = Обк.ПолучитьОбъект();
	Объект.УчетныеДанные.Очистить() ;
	заменяемыйОбк.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУД(Команда)
	ОчиститьУДНаСервере(); 
	Сообщить("Таблица учетные данные очищена и обк записан!");
	Сообщить("Убедитесь что очистили УД - Обращения и Задачи!");
	СообщитьОКэшировании();
КонецПроцедуры
