
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	Представление = "Входящее обращение №" + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры

Функция ОрганизацияЯвляетсяСвоей(организация) Экспорт
	Если организация = Неопределено Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	массивКодСвоих = СтрРазделить("000000001,000000002,000000003,000000004,000000005,000000006,000000007,000000008,000000009",",");
	Для Каждого э ИЗ массивКодСвоих Цикл
		Если э = организация.Код Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЛОЖЬ;
КонецФункции

Функция ПолучитьРеквизитыСотрудникаПоФИО(искомоеФИО) экспорт
	результат = Новый Структура("Организация,Должность,Телефон,Почта,Найден", Справочники.Организации.ПустаяСсылка(),"","","",ЛОЖЬ);
	
	Если искомоеФИО = "" Тогда
		Возврат результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗапросНаСозданиеПользователя.Организация КАК Организация,
				   |	ЗапросНаСозданиеПользователя.СотрудникДолжность КАК Должность,
				   |	ЗапросНаСозданиеПользователя.СотрудникТелефон КАК Телефон,
				   |	ЗапросНаСозданиеПользователя.СотрудникКорпПочта КАК Почта
	               |ИЗ
	               |	БизнесПроцесс.ПервичныйДокумент КАК ЗапросНаСозданиеПользователя
	               |ГДЕ
	               |	ЗапросНаСозданиеПользователя.СотрудникФИО = &ФИО
				   |УПОРЯДОЧИТЬ ПО
				   |	Дата УБЫВ";
	Запрос.УстановитьПараметр("ФИО", искомоеФИО);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		результат.Организация = Выборка.Организация;
		результат.Должность = Выборка.Должность;
		результат.Телефон = Выборка.Телефон;
		результат.Почта = Выборка.Почта;
		результат.Найден = ИСТИНА;
	КонецЕсли;
	
	Возврат результат;
КонецФункции