#Область РаботаСФайлами

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ДобавитьФайлВБД();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	СохранитьФайлНаДиск();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВБД()
	Перем ВыбранноеИмя, АдресВременногоХранилища;	
	
	Если ЭтаФорма.Модифицированность = Истина  ИЛИ Объект.Ссылка.Пустая() Тогда
		Предупреждение("Перед добавлением файлов необходимо сохранить текущий документ",,"Внимание!!!");
	иначе

	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		    
	    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	    ДиалогОткрытияФайла.Заголовок = "Выберите файл для загрузки";
	    ДиалогОткрытияФайла.Фильтр = "Все файлы (*.*)|*.*|Документ PDF(*.pdf)|*.pdf|HTML(*.html)|*.html;*.htm";
	    ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина; 
	    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		
	    Если ДиалогОткрытияФайла.Выбрать() Тогда
	        ИмяФайла= ДиалогОткрытияФайла.ПолноеИмяФайла; 
			
			КороткоеИмя = Сред(ДиалогОткрытияФайла.ПолноеИмяФайла, СтрДлина(ДиалогОткрытияФайла.Каталог) + 1);
			Если ПоместитьФайл(АдресВременногоХранилища, ИмяФайла, ВыбранноеИмя, Ложь, УникальныйИдентификатор) Тогда
	            Изображение = АдресВременногоХранилища;
			КонецЕсли;					
			
			выбратьФайлНаСервере(АдресВременногоХранилища,КороткоеИмя);
			
			ЭтаФорма.Прочитать();			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура выбратьФайлНаСервере(Адрес,ВыбранноеИмяФайла)
	
	о = Объект.Ссылка.ПолучитьОбъект();
	НовыйЭлемент = о.Файлы.Добавить();    

	НовыйЭлемент.ИмяФайла = ВыбранноеИмяФайла;
	НовыйЭлемент.ДанныеФайла = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес) );
	НовыйЭлемент.УИД =  Новый УникальныйИдентификатор();
	
	о.Записать();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлНаДиск()
	
	УИД = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.УИД;
	НомерСтроки = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока;
	СсылкаНаФайл = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Файлы.ДанныеФайла",НомерСтроки);	
	о = СохранитьВФайлНаСервере(УИД);	
	ПолучитьФайл(СсылкаНаФайл,о);

КонецПроцедуры

&НаСервере
Функция  СохранитьВФайлНаСервере(УИД)
	о = Объект.Ссылка.ПолучитьОбъект().Файлы.НайтиСтроки( Новый Структура("УИД", УИД) );
	Возврат о[0].ИмяФайла; 
КонецФункции

#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияВидимости();
	ЭтаФорма.ТолькоПросмотр = Объект.Стартован;
	Элементы.Файлы.КоманднаяПанель.ПодчиненныеЭлементы.ФайлыЗагрузитьФайл.Видимость = НЕ Объект.Стартован;
	Если НЕ ЗначениеЗаполнено(Объект.ЗаявительФИО) ИЛИ НЕ ЗначениеЗаполнено(Объект.ЗаявительДолжность) Тогда
		заполнитьШапкуБизнесПроцесса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИнициализацияВидимости()
	Элементы.ШагЗадачи.Видимость = ЗначениеЗаполнено(Объект.ШагЗадачи);
	ЭтаФорма.КоманднаяПанель.Видимость = НЕ Объект.Стартован;
КонецПроцедуры

&НаСервере
Процедура заполнитьШапкуБизнесПроцесса()

	результат = РегистрыСведений.СопоставлениеАдресации.получитьДанныеПользователяИПодписантов();
	Если результат.Количество() <> 0 Тогда
		Если результат[0].Выгрузить().Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, результат[0].Выгрузить()[0]);
		КонецЕсли;
		
		Если результат[1].Выгрузить().Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, результат[1].Выгрузить()[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


	