
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДоступ)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДоступ(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДоступ(ТабДок, ПараметрКоманды)
	Справочники.Пользователи.ПечатьДоступ(ТабДок, ПараметрКоманды);
КонецПроцедуры
