 Функция ПолучитьИДПользователя(ИмяПользователя) Экспорт
	 
	 ПользовательКонфигурации = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	 Если ПользовательКонфигурации = Неопределено Тогда
		 Возврат Неопределено;
	 КонецЕсли;
	 
	 Возврат ПользовательКонфигурации.УникальныйИдентификатор;
	  
 КонецФункции
 
Функция ПолучитМассивАдресовСледующихАресатов(имяТекущейТочки) Экспорт
	 
	 точкиПерехода = Новый Структура("РуководительИсполнителей,Исполнитель","Руководитель исполнителей", "Исполнитель");
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	СопоставлениеАдресации.Пользователь.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
	                |ИЗ
	                |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	                |ГДЕ
	                |	СопоставлениеАдресации.ФункционалВТекущейИБ.ИмяПредопределенныхДанных = &функцииВИБ";
	 Запрос.УстановитьПараметр("функцииВИБ", точкиПерехода[имяТекущейТочки]);	 
	 
	 адресаМассив = Новый Массив;
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 адресаМассив.Добавить(Выборка.АдресЭлектроннойПочты);
	 КонецЦикла;

	 Возврат адресаМассив;
	 
КонецФункции