Функция ПолучитьПредыдущийШагЗадачи(шаг) Экспорт
	Возврат ПолучитьНомерТекШага(шаг, "назад");	
КонецФункции

Функция ПолучитьСледующийШагЗадачи(шаг) Экспорт
	Возврат ПолучитьНомерТекШага(шаг, "вперед");
КонецФункции

Функция ПолучитьНомерТекШага(шаг, направление) 
	индексШага = Перечисления[шаг.Метаданные().имя].Индекс(шаг);
	шагИмя = Метаданные.Перечисления[шаг.Метаданные().имя].ЗначенияПеречисления[индексШага].Имя;
	шагСтруктура = Новый Структура("Корректировка,ПринятиеВРаботу,Исполнение,Завершение,Отказ", 0,1,2,3,4);	
	
	шагМассив = Новый Массив();
	шагМассив.Добавить("Корректировка");
	шагМассив.Добавить("ПринятиеВРаботу");
	шагМассив.Добавить("Исполнение");
	шагМассив.Добавить("Завершение");
	шагМассив.Добавить("Отказ");
	
	Если направление = "вперед" Тогда
		направление = ?(шагСтруктура[шагИмя] + 1 > 6, 6, шагСтруктура[шагИмя] + 1);
	Иначе
		направление = ?(шагСтруктура[шагИмя] - 1 < 0, 0, шагСтруктура[шагИмя] - 1);
	КонецЕсли;
	
	Возврат Перечисления.ШагЗадачи[ шагМассив[направление] ];
КонецФункции